app/controllers/episodes_controller.rb

SELECT * FROM "episode_views" WHERE (episode_id = 123 AND user_id = 1) ORDER BY id DESC LIMIT 1
SELECT * FROM "contributions" WHERE ("contributions"."episode_id" = 88)
---
  def show
    #@episode = Episode.find_by_season_and_episode(params[:season], params[:episode])
    #@episode = Episode.find(params[:id])

    @user_id = current_user ? current_user.id : nil
    last_viewing = @user_id ? EpisodeView.first(
            :conditions => ["episode_id = ? AND user_id = ?", @episode.id, @user_id],
            :order => "id DESC") : nil
    @last_watched = last_viewing ? last_viewing.friendly_timespan : "Never"

    @directors = Contribution.find_directors(@episode)