app/controllers/episode_views_controller.rb

    def tally
        @user = User.find_by_id(params[:user_id])
        @episode = Episode.find_by_id(params[:episode_id])
        EpisodeView.create(:user => @user, :episode => @episode)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "episodes" WHERE ("episodes"."id" = '123') LIMIT 1
INSERT INTO "episode_views" ("created_at", "updated_at", "user_id", "episode_id") VALUES('2011-06-09 21:02:30', '2011-06-09 21:02:30', 2, 123)