app/controllers/episodes_controller.rb

  def show
    @episode = Episode.find(params[:id])
---
SELECT * FROM "episodes" WHERE (cached_slug LIKE 'season-1-episode-1-simpsons-roasting-on-an-open-fire%') LIMIT 1

  def rate
    @episode = Episode.find(params[:id])
---
SELECT * FROM "episodes" WHERE ("episodes"."id" = 123)