app/controllers/season_controller.rb

  def show
    @season = params[:season]
    @episodes = Episode.find_all_by_season(@season, :order => "episode ASC")
---
SELECT * FROM "episodes" WHERE ("episodes"."season" = '10') ORDER BY episode ASC
SELECT * FROM "seasons" WHERE (cached_slug LIKE 'season-9%') LIMIT 1