app/controllers/seo_controller.rb

    def sitemap
        @seasons = Season.all(:order => "number ASC")
        @episodes = Episode.all(:order => "season_id ASC, episode ASC")
---
SELECT * FROM "seasons" ORDER BY number ASC
SELECT * FROM "episodes" ORDER BY season_id ASC, episode ASC